export const Refund = () => {
  return (
    <div className='w-full bg-white rounded-xl shadow-md p-8'>
      <h1 className='text-3xl font-bold text-center mb-8'>Условия возврата и отмены платежа</h1>
      <div>
        <p>
          1. Поскольку предоставляемая услуга является подпиской на сервис анализа маркетинговой кампании, она носит
          непрерывный характер, и возврат средств не предусмотрен.
        </p>
        <p>
          2. Пользователь имеет возможность отменить платеж до момента осуществления оплаты. После успешной оплаты
          платеж не подлежит отмене.
        </p>
        <p>
          3. В случае возникновения споров или разногласий по поводу оплаты или услуги, пользователь может обратиться в
          службу поддержки по указанным на сайте контактным данным для урегулирования ситуации.
        </p>
        <p>
          4. При возникновении споров или разногласий, специалисты службы поддержки будут принимать все необходимые меры
          для решения проблемы в кратчайшие сроки с учетом интересов обеих сторон.
        </p>
        <p>
          5. В случае необходимости дополнительной информации или обсуждения иных вопросов, пользователи могут связаться
          с нами по указанным на сайте контактным данным.
        </p>
      </div>
    </div>
  );
};
